//SBGOLOBM JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//MEMZAP EXEC PGM=MEMZAP,PARM='DMP 00006F80'
//STEPLIB DD  DISP=SHR,DSN=SYS1.CBT.LINKLIB
